In [1]:
import pandas as pd
import numpy as np

In [7]:
df.head()

,rev_id,comment,year,logged_in,ns,sample,split
0,37675,`-NEWLINE_TOKENThis is not ``creative``. Thos...,2002,False,article,random,train
1,44816,`NEWLINE_TOKENNEWLINE_TOKEN:: the term ``stand...,2002,False,article,random,train
2,49851,"NEWLINE_TOKENNEWLINE_TOKENTrue or false, the s...",2002,False,article,random,train
3,89320,"Next, maybe you could work on being less cond...",2002,True,article,random,dev
4,93890,This page will need disambiguation.,2002,True,article,random,train

In [10]:
df = pd.read_csv('/Users/allen/Downloads/Wikipedia_Talk_Labels_Personal_Attacks_4054689/attack_annotated_comments.tsv',
                sep='\t')
re = pd.read_csv("/Users/allen/Downloads/Wikipedia_Talk_Labels_Personal_Attacks_4054689/attack_annotations.tsv",
              sep='\t')
dm = pd.read_csv("/Users/allen/Downloads/Wikipedia_Talk_Labels_Personal_Attacks_4054689/attack_worker_demographics.tsv",
              sep='\t')

In [162]:
# Top attack reviews
re_top_5 = re.groupby('rev_id').count().sort_values('recipient_attack', ascending=False).head(5).reset_index()
re_top_5

,rev_id,worker_id,quoting_attack,recipient_attack,third_party_attack,other_attack,attack
0,282042816,46,46,46,46,46,46
1,561834118,45,45,45,45,45,45
2,24646599,39,39,39,39,39,39
3,394891461,39,39,39,39,39,39
4,30266565,39,39,39,39,39,39

## Demographic

In [27]:
dm.head()

   worker_id  gender  english_first_language age_group     education
0        833  female                       0     45-60     bachelors
1       1072    male                       0     30-45     bachelors
2        872    male                       0     18-30            hs
3       2116    male                       0     30-45  professional
4        453    male                       0     30-45            hs

In [46]:
dm.groupby('gender')['worker_id'].count().sort_values(ascending=False)/dm.shape[0]

gender
male      0.615982
female    0.383562
other     0.000457
Name: worker_id, dtype: float64

In [33]:
dm.groupby('english_first_language')['worker_id'].count()

english_first_language
0    1788
1     402
Name: worker_id, dtype: int64

In [45]:
dm.groupby('age_group')['worker_id'].count().sort_values(ascending=False)/dm.shape[0]

age_group
18-30       0.478995
30-45       0.379452
45-60       0.099543
Under 18    0.016895
Over 60     0.009132
Name: worker_id, dtype: float64

In [44]:
dm.groupby('education')['worker_id'].count().sort_values(ascending=False)/dm.shape[0]

education
bachelors       0.393607
hs              0.288128
masters         0.175799
professional    0.110959
some            0.021918
doctorate       0.009132
none            0.000457
Name: worker_id, dtype: float64

In [163]:
df_1 = pd.merge(re, dm, how='inner', on='worker_id')
df_1.head()

,rev_id,worker_id,quoting_attack,recipient_attack,third_party_attack,other_attack,attack,gender,english_first_language,age_group,education
0,37675,1362,0.0,0.0,0.0,0.0,0.0,male,0,18-30,masters
1,3202092,1362,0.0,0.0,0.0,0.0,0.0,male,0,18-30,masters
2,4745553,1362,0.0,0.0,0.0,0.0,0.0,male,0,18-30,masters
3,4855563,1362,0.0,0.0,0.0,0.0,0.0,male,0,18-30,masters
4,8350378,1362,0.0,0.0,0.0,0.0,0.0,male,0,18-30,masters

In [169]:
# 
a = df_1.groupby(['gender'])['quoting_attack','recipient_attack','third_party_attack','other_attack','attack'].sum()
b = np.array([840, 1349, 1]).reshape(3,1)
np.multiply(a, 1/b)

,quoting_attack,recipient_attack,third_party_attack,other_attack,attack
gender,,,,,
female,3.105952,42.507143,14.467857,12.182143,63.673810
male,2.899926,42.216457,12.890289,13.085990,64.385471
other,1.000000,26.000000,10.000000,0.000000,37.000000